Тестовая_база_ERP_14/src/Catalogs/CRM_Триггеры/CRM_Триггеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Триггеры</name>
  <attributes>
    <name>Действие</name>
    <type>
      <types>CatalogRef.CRM_ДействияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеСрабатывания</name>
    <type>
      <types>CatalogRef.CRM_УсловияСрабатыванияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиУсловий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиДействий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПовторноеСрабатывание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложенноеВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноНа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноПериодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьВСостоянииИнтереса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/CRM_Триггеры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	Если УсловиеСрабатывания = Справочники.CRM_УсловияСрабатыванияТриггеров.ПоРасписанию Тогда
		СписокЗаданий = Новый Массив;
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Новый Структура("Ключ", УникальныйИдентификаторЗадания));
		КонецЕсли;
		
		Если СписокЗаданий.Количество() = 0 Тогда
			ПараметрыЗадания = Новый Структура("Использование", Ложь);
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.CRM_ВыполнениеТриггеров);
			УникальныйИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
			ПараметрыЗадания.Вставить("Ключ", УникальныйИдентификаторЗадания);
			ПараметрыЗадания.Вставить("Наименование", "Периодическое выполнение триггера: "+Наименование);
			ПараметрыСтруктура = Новый Структура;
			ПараметрыСтруктура.Вставить("УникальныйИдентификаторЗадания", УникальныйИдентификаторЗадания);
			ПараметрыВыполненияЗадания = Новый Массив;
			ПараметрыВыполненияЗадания.Добавить(ПараметрыСтруктура);
			ПараметрыЗадания.Вставить("Параметры", ПараметрыВыполненияЗадания);
			РегламентноеЗадание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		Иначе	
			Для Каждого Задание Из СписокЗаданий Цикл
				ПараметрыЗадания = Новый Структура("Использование", (Строка(Задание.Расписание) <> "один день; один раз в день" И Действует));
				ПараметрыЗадания.Вставить("Наименование", "Периодическое выполнение триггера: "+Наименование);
				ПараметрыСтруктура = Новый Структура;
				ПараметрыСтруктура.Вставить("УникальныйИдентификаторЗадания", УникальныйИдентификаторЗадания);
				ПараметрыВыполненияЗадания = Новый Массив;
				ПараметрыВыполненияЗадания.Добавить(ПараметрыСтруктура);
				ПараметрыЗадания.Вставить("Параметры", ПараметрыВыполненияЗадания);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
			КонецЦикла;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Новый Структура("Ключ", УникальныйИдентификаторЗадания));
			Для Каждого Задание Из СписокЗаданий Цикл
				ПараметрыЗадания = Новый Структура("Использование", Ложь);
				РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ПометкаУдаления Тогда
		Действует = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	Если ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			GUIDЗадания = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(GUIDЗадания);
			РегламентноеЗадание.Удалить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
